---
kind: property
id: P:Autodesk.Revit.DB.TextNoteOptions.Rotation
source: html/003d9e36-c831-af50-c7e8-182f11464680.htm
---
# Autodesk.Revit.DB.TextNoteOptions.Rotation Property

Base line angle of a text note, in radians.

## Syntax (C#)
```csharp
public double Rotation { get; set; }
```

## Remarks
Default value is 0.0.